#ifndef     PNEUMO_HOSE_DATA_H
#define     PNEUMO_HOSE_DATA_H

//------------------------------------------------------------------------------
// Сигналы рукавов пневмомагистралей
//------------------------------------------------------------------------------
enum
{
    HOSE_OUTPUT_REF_STATE = 0,  ///< Управление рукавами: 1.0 - соединить, -1.0 - разъединить, 0.0 - оставить текущее состояние
    HOSE_OUTPUT_PIPE_PRESSURE,  ///< Давление в пневматической магистрали
    HOSE_OUTPUT_FLOW_COEFF,     ///< Коэффицент перетока через рукав
    HOSE_OUTPUT_LENGTH_MIDDLE,  ///< Длина средней части рукава (от точки изгиба в начале до точки изгиба перед соединительной головкой), м
    HOSE_OUTPUT_LENGTH_HEAD,    ///< Длина жёсткого окончания рукава с соединительной головкой, м
    HOSE_OUTPUT_ROOT_COORD_X,   ///< Координата X точки крепления рукава, м
    HOSE_OUTPUT_ROOT_COORD_Y,   ///< Координата Y точки крепления рукава, м
    HOSE_OUTPUT_ROOT_COORD_Z,   ///< Координата Z точки крепления рукава, м

    HOSE_SIZE_OF_OUTPUTS,       ///< Размер массива исходящих сигналов


    HOSE_INPUT_IS_CONNECTED = 0,    ///< Состояние соединения рукавов: 1.0 - соединены, 0.0 - разъединены
    HOSE_INPUT_FLOW_TO_PIPE,        ///< Поток в пневматическую магистраль
    HOSE_INPUT_HEAD_ROOT_COORD_X,   ///< Координата X точки крепления соединительной головки, м
    HOSE_INPUT_HEAD_ROOT_COORD_Y,   ///< Координата X точки крепления соединительной головки, м
    HOSE_INPUT_HEAD_ROOT_COORD_Z,   ///< Координата X точки крепления соединительной головки, м
    HOSE_INPUT_HEAD_ROOT_ANGLE_UP,  ///< Угол изгиба рукава вверх перед соединительной головкой, радиан

    HOSE_SIZE_OF_INPUTS        ///< Размер массива входящих сигналов
};

//------------------------------------------------------------------------------
// Дополнительно: сигналы линий электропневматического тормоза
// (для удобства входящие и исходящие сигналы с одинаковыми индексами,
//  начинаются после максимального индекса исходящих сигналов базового рукава)
//------------------------------------------------------------------------------
enum
{
    HOSE_OUTPUT_EPB_LINES_NUM = HOSE_SIZE_OF_OUTPUTS,      ///< Сигнал с количеством линий управления ЭПТ

    BEGIN_OF_EPB_LINE_SIGNALS,      ///< Индекс элемента - начала массива сигналов управления ЭПТ

    EPB_LINE_OUTPUT_VOLTAGE = 0,    ///< Напряжение
    EPB_LINE_OUTPUT_FREQUENCY,      ///< Частота переменного напряжения
    EPB_LINE_OUTPUT_CURRENT,        ///< Потребляемый ток
    SIZE_OF_SIGNALS_PER_EPB_LINE,   ///< Размер массива исходящих сигналов на каждую линию управления ЭПТ


    HOSE_INPUT_EPB_CONNECTED_NUM = HOSE_OUTPUT_EPB_LINES_NUM,    ///< Сигнал с количеством соединённых линий управления ЭПТ

    EPB_LINE_INPUT_VOLTAGE = EPB_LINE_OUTPUT_VOLTAGE,       ///< Напряжение
    EPB_LINE_INPUT_FREQUENCY = EPB_LINE_OUTPUT_FREQUENCY,   ///< Частота переменного напряжения
    EPB_LINE_INPUT_CURRENT = EPB_LINE_OUTPUT_CURRENT,       ///< Потребляемый ток
};

#endif // PNEUMO_HOSE_DATA_H
